

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере(Диаграмма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьОтчетНаСервере(ДГ)
//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияСотрудниковФактическийПериодДействия.Сотрудники,
	|	НачисленияСотрудниковФактическийПериодДействия.ВидРасчета,
	|	НачисленияСотрудниковФактическийПериодДействия.ПериодДействияНачало,
	|	НачисленияСотрудниковФактическийПериодДействия.ПериодДействияКонец
	|ИЗ
	|	РегистрРасчета.НачисленияСотрудников.ФактическийПериодДействия КАК НачисленияСотрудниковФактическийПериодДействия";

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
ДГ.Обновление = Ложь;
ДГ.Очистить();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		Точка = ДГ.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудники);
		Серия = ДГ.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		Значение = ДГ.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();		
		
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
КонецЦикла;

ДГ.Обновление = Истина;
	
КонецПроцедуры