
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.НачисленияСотрудников.Записывать = Истина;
	Движения.НачисленияСотрудников.Очистить();
	Для Каждого ТекСтрокаНачисления из Начисления Цикл

		Движение = Движения.НачисленияСотрудников.Добавить();
//		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
//		Движение.Сотрудники = ТекСтрокаНачисления.Сотрудники;
//		Движение.Сумма = ТекСтрокаНачисления.Сумма;
//		Движение.Параметр = ТекСтрокаНачисления.Параметр;
	
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаНачисления );
		
	КонецЦикла;

	Дополнения = Движения.НачисленияСотрудников.ПолучитьДополнение();

	Для Каждого Стр Из Дополнения Цикл
		
		Движение = Движения.НачисленияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.ПериодРегистрации = Стр.ПериодРегистрацииСторно;
		Движение.ПериодДействияНачало = Стр.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Стр.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
		
	КонецЦикла;

	Движения.Записать();
	Расчеты.РасчитатьПремию(Ссылка);

КонецПроцедуры
